Public Member Functions | Friends | List of all members
ACAPI::LicenseInfo::v1::ProductVersionInfo Class Reference
LicenseInfo
ProductVersionInfo is the central point of the product-related informations. More...
#include <ProductVersionInfo.hpp>
 Inheritance diagram for ACAPI::LicenseInfo::v1::ProductVersionInfo:
 Public Member Functions
GS::UniString  | GetProductFamilyId () const
GS::UniString  | GetGSLanguageCode () const
GS::UniString  | GetVersionString () const
Int32  | GetVersionNum1 () const
Int32  | GetVersionNum2 () const
Int32  | GetVersionNum3 () const
Int32  | GetBuildNum () const
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::LicenseInfoManagerImpl
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
ProductVersionInfo is the central point of the product-related informations.
Since
Archicad 28